```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.account_Password_PolicySettings[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettings"
      + value                        = "Check: Configured"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_MaxAge[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_MaxAge" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsMaxAge"
      + value                        = "90"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_MinimumLength[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_MinimumLength" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsMinimumLength"
      + value                        = "14"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_RequireNumbers[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_RequireNumbers" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireNumbers"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_RequireSymbols[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_RequireSymbols" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireSymbols"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_RequireUppercaseCharacters[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_RequireUppercaseCharacters" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsRequireUppercaseCharacters"
      + value                        = "Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.account_Password_PolicySettings_ReusePrevention[0] will be created
  + resource "turbot_policy_setting" "account_Password_PolicySettings_ReusePrevention" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accountPasswordPolicySettingsReusePrevention"
      + value                        = "24"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_group_policy_attachement_approved[0] will be created
  + resource "turbot_policy_setting" "aws_iam_group_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupPolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_group_policy_attachement_rules[0] will be created
  + resource "turbot_policy_setting" "aws_iam_group_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupPolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_user_policy_attachement_approved[0] will be created
  + resource "turbot_policy_setting" "aws_iam_user_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userPolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_iam_user_policy_attachement_rules[0] will be created
  + resource "turbot_policy_setting" "aws_iam_user_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userPolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_group_inline_policy_approved[0] will be created
  + resource "turbot_policy_setting" "iam_group_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_group_inline_policy_approved_admin_access[0] will be created
  + resource "turbot_policy_setting" "iam_group_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/groupInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_policy_approved[0] will be created
  + resource "turbot_policy_setting" "iam_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/iamPolicyApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_policy_approved_statements[0] will be created
  + resource "turbot_policy_setting" "iam_policy_approved_statements" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- set anyStar = r/\*/g -%}
            {%- set goodStar = r/(Get|List)\*/g -%}
            {%- set approved = true -%}
            {%- for statement in $.policy.statements -%}
                {%- for action in statement.Action -%}
                    {%- if anyStar.test(action) -%}
                        {%- if not goodStar.test(action) -%}
                            {%- set approved = false -%}
                        {%- endif -%}
                    {%- endif -%}
                {%- endfor -%}
            {%- endfor -%}
            {%- if approved  -%}
                "Approved"
            {%- else -%}
                "Not approved"
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
                policy: resource {
                    statements: get(path: "PolicyVersion.Statement")
                }
            }
        EOT
      + type                         = "tmod:@turbot/aws-iam#/policy/types/iamPolicyApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_inline_policy_approved[0] will be created
  + resource "turbot_policy_setting" "iam_role_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/roleInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_inline_policy_approved_admin_access[0] will be created
  + resource "turbot_policy_setting" "iam_role_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/roleInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_policy_attachement_approved[0] will be created
  + resource "turbot_policy_setting" "iam_role_policy_attachement_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyAttachmentsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_policy_attachement_rules[0] will be created
  + resource "turbot_policy_setting" "iam_role_policy_attachement_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyAttachmentsApprovedRules"
      + value                        = <<-EOT
            REJECT $.PolicyName:/^.+FullAccess.*$/
            REJECT $.PolicyName:AdministratorAccess
            APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_policy_trusted_access[0] will be created
  + resource "turbot_policy_setting" "iam_role_policy_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyTrustedAccess"
      + value                        = "Check: Trusted Access"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_role_trusted_accounts[0] will be created
  + resource "turbot_policy_setting" "iam_role_trusted_accounts" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            - {{ $.account.Id }}
            - "287590803701"	#Turbot SaaS Account
            - "255798382450"  #Turbot SaaS EU Account
            - "525041748188"	#Turbot SaaS Dev Account
        EOT
      + template_input               = <<-EOT
            {
            	account{
            		Id
            		}
            }
        EOT
      + type                         = "tmod:@turbot/aws-iam#/policy/types/rolePolicyTrustedAccounts"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_access_key_active[0] will be created
  + resource "turbot_policy_setting" "iam_user_access_key_active" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accessKeyActive"
      + value                        = "Check: Active"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_access_key_active_age[0] will be created
  + resource "turbot_policy_setting" "iam_user_access_key_active_age" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/accessKeyActiveAge"
      + value                        = "Force inactive if age > 90 days"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_inline_policy_approved[0] will be created
  + resource "turbot_policy_setting" "iam_user_inline_policy_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userInlinePolicyStatementsApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_inline_policy_approved_admin_access[0] will be created
  + resource "turbot_policy_setting" "iam_user_inline_policy_approved_admin_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userInlinePolicyStatementsApprovedAdminAccess"
      + value                        = <<-EOT
            	'Disabled: Disallow Administrator Access (''*:*'') policies'
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_mfa_approved[0] will be created
  + resource "turbot_policy_setting" "iam_user_mfa_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.iam_user_mfa_approved_usage[0] will be created
  + resource "turbot_policy_setting" "iam_user_mfa_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- set matches = false -%}
            {%- for v in $.resources.items -%}
            	{%- if v.usertest == $.user.UserName -%}
            	{%- set matches = true -%}
            	{%- endif -%}
            {%- endfor -%}
            {%- if matches -%}
            "Approved"
            {%- else -%}
            "Not approved"
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
            	user{
            		Arn
            		UserName
            		}
            resources(filter:"resourceType:'tmod:@turbot/aws-iam#/resource/types/mfaVirtual'") {
            	items {
            		usertest: get(path:"User.UserName")
            		trunk {
            			title
            			}
            		}
            	}
            }
        EOT
      + type                         = "tmod:@turbot/aws-iam#/policy/types/userApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_iam will be created
  + resource "turbot_smart_folder" "aws_iam" {
      + description = "Defines sets of policies for the AWS check S3 baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check IAM Policies"
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + enable_account_Password_PolicySettings                            = true
  + enable_account_Password_PolicySettings_MaxAge                     = true
  + enable_account_Password_PolicySettings_MinimumLength              = true
  + enable_account_Password_PolicySettings_RequireLowercaseCharacters = false
  + enable_account_Password_PolicySettings_RequireNumbers             = true
  + enable_account_Password_PolicySettings_RequireSymbols             = true
  + enable_account_Password_PolicySettings_RequireUppercaseCharacters = true
  + enable_account_Password_PolicySettings_ReusePrevention            = true
  + enable_aws_iam_group_policy_attachement_approved                  = true
  + enable_aws_iam_group_policy_attachement_rules                     = true
  + enable_aws_iam_user_policy_attachement_approved                   = true
  + enable_aws_iam_user_policy_attachement_rules                      = true
  + enable_iam_group_inline_policy_approved                           = true
  + enable_iam_group_inline_policy_approved_admin_access              = true
  + enable_iam_policy_approved                                        = true
  + enable_iam_policy_approved_statements                             = true
  + enable_iam_role_inline_policy_approved                            = true
  + enable_iam_role_inline_policy_approved_admin_access               = true
  + enable_iam_role_policy_attachement_approved                       = true
  + enable_iam_role_policy_attachement_rules                          = true
  + enable_iam_role_policy_trusted_access                             = true
  + enable_iam_role_trusted_accounts                                  = true
  + enable_iam_user_access_key_active                                 = true
  + enable_iam_user_access_key_active_age                             = true
  + enable_iam_user_inline_policy_approved                            = true
  + enable_iam_user_inline_policy_approved_admin_access               = true
  + enable_iam_user_mfa_approved                                      = true
  + enable_iam_user_mfa_approved_usage                                = true
  + smart_folder_description                                          = "Defines sets of policies for the AWS check S3 baseline"
  + smart_folder_name                                                 = "AWS Check IAM Policies"
  + smart_folder_parent_resource                                      = "tmod:@turbot/turbot#/"
  + turbot_profile                                                    = "default"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_iam: Creating...
turbot_smart_folder.aws_iam: Creation complete after 2s [id=215803397997870]
turbot_policy_setting.account_Password_PolicySettings_RequireUppercaseCharacters[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_RequireNumbers[0]: Creating...
turbot_policy_setting.iam_user_inline_policy_approved_admin_access[0]: Creating...
turbot_policy_setting.iam_role_inline_policy_approved_admin_access[0]: Creating...
turbot_policy_setting.iam_user_mfa_approved[0]: Creating...
turbot_policy_setting.iam_role_policy_attachement_rules[0]: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_approved[0]: Creating...
turbot_policy_setting.iam_policy_approved_statements[0]: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_rules[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_RequireSymbols[0]: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_rules[0]: Creation complete after 4s [id=215803402450250]
turbot_policy_setting.account_Password_PolicySettings_RequireNumbers[0]: Creation complete after 4s [id=215803402540377]
turbot_policy_setting.account_Password_PolicySettings[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_MinimumLength[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_RequireUppercaseCharacters[0]: Creation complete after 4s [id=215803402278212]
turbot_policy_setting.iam_role_inline_policy_approved_admin_access[0]: Creation complete after 4s [id=215803402510677]
turbot_policy_setting.account_Password_PolicySettings_RequireSymbols[0]: Creation complete after 4s [id=215803402564960]
turbot_policy_setting.iam_group_inline_policy_approved_admin_access[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_MaxAge[0]: Creating...
turbot_policy_setting.iam_role_trusted_accounts[0]: Creating...
turbot_policy_setting.aws_iam_group_policy_attachement_approved[0]: Creation complete after 4s [id=215803402258753]
turbot_policy_setting.iam_policy_approved_statements[0]: Creation complete after 4s [id=215803402493262]
turbot_policy_setting.iam_role_policy_attachement_rules[0]: Creation complete after 4s [id=215803402564961]
turbot_policy_setting.iam_group_inline_policy_approved[0]: Creating...
turbot_policy_setting.aws_iam_user_policy_attachement_rules[0]: Creating...
turbot_policy_setting.iam_user_mfa_approved_usage[0]: Creating...
turbot_policy_setting.iam_user_mfa_approved[0]: Creation complete after 5s [id=215803402555741]
turbot_policy_setting.iam_role_policy_attachement_approved[0]: Creating...
turbot_policy_setting.iam_role_trusted_accounts[0]: Creation complete after 2s [id=215803404203371]
turbot_policy_setting.iam_user_access_key_active_age[0]: Creating...
turbot_policy_setting.iam_user_mfa_approved_usage[0]: Creation complete after 3s [id=215803404392816]
turbot_policy_setting.aws_iam_user_policy_attachement_approved[0]: Creating...
turbot_policy_setting.account_Password_PolicySettings_MaxAge[0]: Creation complete after 3s [id=215803404835189]
turbot_policy_setting.iam_role_policy_trusted_access[0]: Creating...
turbot_policy_setting.iam_role_policy_attachement_approved[0]: Creation complete after 2s [id=215803405385082]
turbot_policy_setting.account_Password_PolicySettings_ReusePrevention[0]: Creating...
turbot_policy_setting.iam_group_inline_policy_approved_admin_access[0]: Creation complete after 3s [id=215803405843840]
turbot_policy_setting.iam_role_inline_policy_approved[0]: Creating...
turbot_policy_setting.iam_user_inline_policy_approved_admin_access[0]: Creation complete after 7s [id=215803406024069]
turbot_policy_setting.account_Password_PolicySettings_MinimumLength[0]: Creation complete after 3s [id=215803406200206]
turbot_policy_setting.iam_user_inline_policy_approved[0]: Creating...
turbot_policy_setting.iam_user_access_key_active[0]: Creating...
turbot_policy_setting.iam_user_access_key_active_age[0]: Creation complete after 1s [id=215803406238098]
turbot_policy_setting.iam_policy_approved[0]: Creating...
turbot_policy_setting.iam_group_inline_policy_approved[0]: Creation complete after 4s [id=215803406301591]
turbot_policy_setting.iam_user_inline_policy_approved[0]: Creation complete after 2s [id=215803407873437]
turbot_policy_setting.aws_iam_user_policy_attachement_rules[0]: Creation complete after 5s [id=215803406141834]
turbot_policy_setting.iam_policy_approved[0]: Creation complete after 3s [id=215803408141735]
turbot_policy_setting.aws_iam_user_policy_attachement_approved[0]: Creation complete after 3s [id=215803409001901]
turbot_policy_setting.iam_user_access_key_active[0]: Creation complete after 3s [id=215803408114083]
turbot_policy_setting.iam_role_policy_trusted_access[0]: Creation complete after 4s [id=215803409592756]
turbot_policy_setting.iam_role_inline_policy_approved[0]: Creation complete after 4s [id=215803409707450]
turbot_policy_setting.account_Password_PolicySettings[0]: Creation complete after 7s [id=215803409587633]
turbot_policy_setting.account_Password_PolicySettings_ReusePrevention[0]: Creation complete after 5s [id=215803410620863]

Apply complete! Resources: 28 added, 0 changed, 0 destroyed.

Outputs:

enable_account_Password_PolicySettings = true
enable_account_Password_PolicySettings_MaxAge = true
enable_account_Password_PolicySettings_MinimumLength = true
enable_account_Password_PolicySettings_RequireLowercaseCharacters = false
enable_account_Password_PolicySettings_RequireNumbers = true
enable_account_Password_PolicySettings_RequireSymbols = true
enable_account_Password_PolicySettings_RequireUppercaseCharacters = true
enable_account_Password_PolicySettings_ReusePrevention = true
enable_aws_iam_group_policy_attachement_approved = true
enable_aws_iam_group_policy_attachement_rules = true
enable_aws_iam_user_policy_attachement_approved = true
enable_aws_iam_user_policy_attachement_rules = true
enable_iam_group_inline_policy_approved = true
enable_iam_group_inline_policy_approved_admin_access = true
enable_iam_policy_approved = true
enable_iam_policy_approved_statements = true
enable_iam_role_inline_policy_approved = true
enable_iam_role_inline_policy_approved_admin_access = true
enable_iam_role_policy_attachement_approved = true
enable_iam_role_policy_attachement_rules = true
enable_iam_role_policy_trusted_access = true
enable_iam_role_trusted_accounts = true
enable_iam_user_access_key_active = true
enable_iam_user_access_key_active_age = true
enable_iam_user_inline_policy_approved = true
enable_iam_user_inline_policy_approved_admin_access = true
enable_iam_user_mfa_approved = true
enable_iam_user_mfa_approved_usage = true
smart_folder_description = "Defines sets of policies for the AWS check S3 baseline"
smart_folder_name = "AWS Check IAM Policies"
smart_folder_parent_resource = "tmod:@turbot/turbot#/"
turbot_profile = "default"
```